{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "name": "source", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "source"}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "source_embedding", "config": {"embeddings_regularizer": null, "batch_input_shape": [null, null], "mask_zero": true, "name": "source_embedding", "embeddings_constraint": null, "input_length": null, "dtype": "float32", "input_dim": 2681, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "trainable": true, "output_dim": 100, "activity_regularizer": null}, "inbound_nodes": [[["source", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "hidden_target", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "name": "hidden_target"}, "inbound_nodes": []}, {"class_name": "Bidirectional", "name": "bidirectional_1", "config": {"layer": {"class_name": "LSTM", "config": {"unroll": false, "implementation": 0, "return_sequences": true, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 32, "use_bias": true, "kernel_constraint": null, "return_state": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "h_s", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, "name": "bidirectional_1", "merge_mode": "concat", "trainable": true}, "inbound_nodes": [[["source_embedding", 0, 0, {}]]]}, {"class_name": "RepeatVector", "name": "repeat_vector_1", "config": {"name": "repeat_vector_1", "n": 12, "trainable": true}, "inbound_nodes": [[["hidden_target", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_1", "config": {"name": "multiply_1", "trainable": true}, "inbound_nodes": [[["repeat_vector_1", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_2", "config": {"name": "multiply_2", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["dense_2", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "cell_target", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "name": "cell_target"}, "inbound_nodes": []}, {"class_name": "LSTM", "name": "lstm_1", "config": {"unroll": false, "implementation": 0, "return_sequences": false, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 64, "use_bias": true, "kernel_constraint": null, "return_state": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_1", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}, "inbound_nodes": [[["multiply_2", 0, 0, {}], ["hidden_target", 0, 0, {}], ["cell_target", 0, 0, {}]]]}, {"class_name": "RepeatVector", "name": "repeat_vector_2", "config": {"name": "repeat_vector_2", "n": 12, "trainable": true}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_3", "config": {"name": "multiply_3", "trainable": true}, "inbound_nodes": [[["repeat_vector_2", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["multiply_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_4", "config": {"name": "multiply_4", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_2", "config": {"unroll": false, "implementation": 0, "return_sequences": false, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 64, "use_bias": true, "kernel_constraint": null, "return_state": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_2", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}, "inbound_nodes": [[["multiply_4", 0, 0, {}], ["lstm_1", 0, 0, {}], ["lstm_1", 0, 2, {}]]]}, {"class_name": "RepeatVector", "name": "repeat_vector_3", "config": {"name": "repeat_vector_3", "n": 12, "trainable": true}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_5", "config": {"name": "multiply_5", "trainable": true}, "inbound_nodes": [[["repeat_vector_3", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_7", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "name": "dense_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["multiply_5", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_8", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_6", "config": {"name": "multiply_6", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["dense_8", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_3", "config": {"unroll": false, "implementation": 0, "return_sequences": false, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 64, "use_bias": true, "kernel_constraint": null, "return_state": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_3", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}, "inbound_nodes": [[["multiply_6", 0, 0, {}], ["lstm_2", 0, 0, {}], ["lstm_2", 0, 2, {}]]]}, {"class_name": "RepeatVector", "name": "repeat_vector_4", "config": {"name": "repeat_vector_4", "n": 12, "trainable": true}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_7", "config": {"name": "multiply_7", "trainable": true}, "inbound_nodes": [[["repeat_vector_4", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_10", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "name": "dense_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["multiply_7", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_11", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_10", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_8", "config": {"name": "multiply_8", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["dense_11", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_4", "config": {"unroll": false, "implementation": 0, "return_sequences": false, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 64, "use_bias": true, "kernel_constraint": null, "return_state": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_4", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}, "inbound_nodes": [[["multiply_8", 0, 0, {}], ["lstm_3", 0, 0, {}], ["lstm_3", 0, 2, {}]]]}, {"class_name": "RepeatVector", "name": "repeat_vector_5", "config": {"name": "repeat_vector_5", "n": 12, "trainable": true}, "inbound_nodes": [[["lstm_4", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_9", "config": {"name": "multiply_9", "trainable": true}, "inbound_nodes": [[["repeat_vector_5", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_13", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "name": "dense_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["multiply_9", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_14", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_13", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_10", "config": {"name": "multiply_10", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_5", "config": {"unroll": false, "implementation": 0, "return_sequences": false, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 64, "use_bias": true, "kernel_constraint": null, "return_state": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_5", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}, "inbound_nodes": [[["multiply_10", 0, 0, {}], ["lstm_4", 0, 0, {}], ["lstm_4", 0, 2, {}]]]}, {"class_name": "RepeatVector", "name": "repeat_vector_6", "config": {"name": "repeat_vector_6", "n": 12, "trainable": true}, "inbound_nodes": [[["lstm_5", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_11", "config": {"name": "multiply_11", "trainable": true}, "inbound_nodes": [[["repeat_vector_6", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_16", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "name": "dense_16", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["multiply_11", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_17", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_17", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_16", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_12", "config": {"name": "multiply_12", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["dense_17", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_6", "config": {"unroll": false, "implementation": 0, "return_sequences": false, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 64, "use_bias": true, "kernel_constraint": null, "return_state": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_6", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}, "inbound_nodes": [[["multiply_12", 0, 0, {}], ["lstm_5", 0, 0, {}], ["lstm_5", 0, 2, {}]]]}, {"class_name": "RepeatVector", "name": "repeat_vector_7", "config": {"name": "repeat_vector_7", "n": 12, "trainable": true}, "inbound_nodes": [[["lstm_6", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_13", "config": {"name": "multiply_13", "trainable": true}, "inbound_nodes": [[["repeat_vector_7", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_19", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "name": "dense_19", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["multiply_13", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_20", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_20", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_19", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_14", "config": {"name": "multiply_14", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["dense_20", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_7", "config": {"unroll": false, "implementation": 0, "return_sequences": false, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 64, "use_bias": true, "kernel_constraint": null, "return_state": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_7", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}, "inbound_nodes": [[["multiply_14", 0, 0, {}], ["lstm_6", 0, 0, {}], ["lstm_6", 0, 2, {}]]]}, {"class_name": "RepeatVector", "name": "repeat_vector_8", "config": {"name": "repeat_vector_8", "n": 12, "trainable": true}, "inbound_nodes": [[["lstm_7", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_15", "config": {"name": "multiply_15", "trainable": true}, "inbound_nodes": [[["repeat_vector_8", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_22", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "name": "dense_22", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["multiply_15", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_23", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_23", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_22", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_16", "config": {"name": "multiply_16", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["dense_23", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_8", "config": {"unroll": false, "implementation": 0, "return_sequences": false, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 64, "use_bias": true, "kernel_constraint": null, "return_state": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_8", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}, "inbound_nodes": [[["multiply_16", 0, 0, {}], ["lstm_7", 0, 0, {}], ["lstm_7", 0, 2, {}]]]}, {"class_name": "RepeatVector", "name": "repeat_vector_9", "config": {"name": "repeat_vector_9", "n": 12, "trainable": true}, "inbound_nodes": [[["lstm_8", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_17", "config": {"name": "multiply_17", "trainable": true}, "inbound_nodes": [[["repeat_vector_9", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_25", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "name": "dense_25", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["multiply_17", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_26", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_26", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_25", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_18", "config": {"name": "multiply_18", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["dense_26", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_9", "config": {"unroll": false, "implementation": 0, "return_sequences": false, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 64, "use_bias": true, "kernel_constraint": null, "return_state": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_9", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}, "inbound_nodes": [[["multiply_18", 0, 0, {}], ["lstm_8", 0, 0, {}], ["lstm_8", 0, 2, {}]]]}, {"class_name": "RepeatVector", "name": "repeat_vector_10", "config": {"name": "repeat_vector_10", "n": 12, "trainable": true}, "inbound_nodes": [[["lstm_9", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_19", "config": {"name": "multiply_19", "trainable": true}, "inbound_nodes": [[["repeat_vector_10", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_28", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "name": "dense_28", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["multiply_19", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_29", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_29", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_28", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_20", "config": {"name": "multiply_20", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["dense_29", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_10", "config": {"unroll": false, "implementation": 0, "return_sequences": false, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 64, "use_bias": true, "kernel_constraint": null, "return_state": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_10", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}, "inbound_nodes": [[["multiply_20", 0, 0, {}], ["lstm_9", 0, 0, {}], ["lstm_9", 0, 2, {}]]]}, {"class_name": "RepeatVector", "name": "repeat_vector_11", "config": {"name": "repeat_vector_11", "n": 12, "trainable": true}, "inbound_nodes": [[["lstm_10", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_21", "config": {"name": "multiply_21", "trainable": true}, "inbound_nodes": [[["repeat_vector_11", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_31", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "name": "dense_31", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["multiply_21", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_32", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_31", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_22", "config": {"name": "multiply_22", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["dense_32", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_11", "config": {"unroll": false, "implementation": 0, "return_sequences": false, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 64, "use_bias": true, "kernel_constraint": null, "return_state": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_11", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}, "inbound_nodes": [[["multiply_22", 0, 0, {}], ["lstm_10", 0, 0, {}], ["lstm_10", 0, 2, {}]]]}, {"class_name": "RepeatVector", "name": "repeat_vector_12", "config": {"name": "repeat_vector_12", "n": 12, "trainable": true}, "inbound_nodes": [[["lstm_11", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_23", "config": {"name": "multiply_23", "trainable": true}, "inbound_nodes": [[["repeat_vector_12", 0, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_34", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "name": "dense_34", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["multiply_23", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_35", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_35", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_34", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_24", "config": {"name": "multiply_24", "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["dense_35", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_12", "config": {"unroll": false, "implementation": 0, "return_sequences": false, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 64, "use_bias": true, "kernel_constraint": null, "return_state": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_12", "kernel_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}, "inbound_nodes": [[["multiply_24", 0, 0, {}], ["lstm_11", 0, 0, {}], ["lstm_11", 0, 2, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 3550, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_6", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 3550, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_9", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 3550, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_12", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 3550, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["lstm_4", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_15", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 3550, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["lstm_5", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_18", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_18", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 3550, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["lstm_6", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_21", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_21", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 3550, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["lstm_7", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_24", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_24", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 3550, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["lstm_8", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_27", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_27", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 3550, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["lstm_9", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_30", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_30", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 3550, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["lstm_10", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_33", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_33", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 3550, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["lstm_11", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_36", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "name": "dense_36", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 3550, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["lstm_12", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["dense_3", 0, 0], ["dense_6", 0, 0], ["dense_9", 0, 0], ["dense_12", 0, 0], ["dense_15", 0, 0], ["dense_18", 0, 0], ["dense_21", 0, 0], ["dense_24", 0, 0], ["dense_27", 0, 0], ["dense_30", 0, 0], ["dense_33", 0, 0], ["dense_36", 0, 0]], "input_layers": [["source", 0, 0], ["hidden_target", 0, 0], ["cell_target", 0, 0]]}}